## Staging: oidc_roles
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                            NAME                                             |
|--------|---------------------------------------------------------------------------------------------|
| add    | `aws_iam_role_policy_attachment.forms_terraform_apply_worfklow_dispatch_admin[0]`           |
|        | `aws_iam_role_policy_attachment.forms_terraform_plan_worfklow_dispatch_readonly[0]`         |
|        | `aws_iam_role_policy_attachment.forms_terraform_plan_worfklow_dispatch_terraform_plan[0]`   |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;forms-terraform-apply-release&quot;]`           |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;forms-terraform-apply-workflow-dispatch&quot;]` |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;forms-terraform-plan-workflow-dispatch&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.forms_terraform_apply_worfklow_dispatch_admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "forms_terraform_apply_worfklow_dispatch_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "forms-terraform-apply-workflow-dispatch"
    }

  # aws_iam_role_policy_attachment.forms_terraform_plan_worfklow_dispatch_readonly[0] will be created
  + resource "aws_iam_role_policy_attachment" "forms_terraform_plan_worfklow_dispatch_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "forms-terraform-plan-workflow-dispatch"
    }

  # aws_iam_role_policy_attachment.forms_terraform_plan_worfklow_dispatch_terraform_plan[0] will be created
  + resource "aws_iam_role_policy_attachment" "forms_terraform_plan_worfklow_dispatch_terraform_plan" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/OIDCPlanPolicy"
      + role       = "forms-terraform-plan-workflow-dispatch"
    }

  # module.github_workflow_roles.aws_iam_role.this["forms-terraform-apply-release"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/forms-terraform:release",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-terraform-apply-release"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.github_workflow_roles.aws_iam_role.this["forms-terraform-apply-workflow-dispatch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/forms-terraform:workflow_dispatch",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-terraform-apply-workflow-dispatch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.github_workflow_roles.aws_iam_role.this["forms-terraform-plan-workflow-dispatch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/forms-terraform:workflow_dispatch",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-terraform-plan-workflow-dispatch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
